#age = "21" #문자
#age1 = 21  #숫자
#age2 = 10 #숫자
#print(f"두 수의 합 {age1 + age2}")

#num = input("입력:")
#num1 = input("입력:")
#print(f"{num + num1}")

#name = "jeon" #문자
#age = 21 #숫자
#age1 = 20
#age2 = "20"
#age3 = "21"
#a = input("숫자:") #문자
#print(f"{age + age1}") # 41
#print(f"{age2 + age3}") # 2021

# 숫자형 타입
a = 10 #정수형 (int)
b = 3.14 #실수형 (float)

# 문자형 타입
c = "mega"
d = 'coffee'
e = """국내 증시가 박스권에 머물고 있지만 투자의 위험성을 경고하는 시장경보 발동 건수는 증가한 것으로 집계됐다. 오는 4월 총선을 앞두고 주가가 급등한 정치 테마주와 함께 최근 주가순자산비율(PBR)이 낮은 ‘저PBR주’가 소수 거래 집중으로 투자경고 종목으로 지정되면서다. 투자경고 혹은 투자위험 종목으로 지정되면 매매거래가 정지될 수 있다. 전문가들은 테마주 급등으로 장 중 증시 변동성이 심해진 만큼 투자에 신중해야 한다고 조언했다.
"""

# 불린형 (Tre or False)
isCoffee = True
isHot = False

